yii/basic/controllers/TestController.php

SELECT * FROM `goods` WHERE `id`='1'
SELECT * FROM `goods` WHERE `id` IN (1, 2, 3)
SELECT * FROM `goods`
SELECT COUNT(id) FROM `goods`
SELECT AVG(price) FROM `goods`
SELECT MIN(price) FROM `goods`
SELECT MAX(price) FROM `goods`
---
    public function actionIndex2(){
       /* echo Yii::$app->urlManager->createAbsoluteUrl( ['index1/100',] );
        echo "<br>";
        echo 'index2';
        echo "<br>";
        dd('aaaa');*/
//       查询
        //方法一： 原生sql
        $sql = 'select * from goods where active=:active';
        $res = Goods::findBySql($sql,['active'=> 1]) ->asArray()->one();
        $res = Goods::findBySql($sql,['active'=> 1]) ->asArray()->all();

        //方法二
        $res = Goods::findOne('1');
        $res = Goods::findAll([1,2,3]);

        //方法三
        $res = Goods::find() -> asArray() -> one();
        $res = Goods::find() -> asArray() -> all();
        $res = Goods::find() -> count('id');
        $res = Goods::find() -> average('price');
        $res = Goods::find() -> min('price');
        $res = Goods::find() -> max('price');

UPDATE `goods` SET `price`=`price`+'-1000' WHERE `id`=36
---
//        dd(Goods::updateAll(['goodsname'=>'小米本'],'id=:id',['id'=>36 ]));
        //自增 自减
       /* for($i=1 ;$i<100;$i++){
            dd(Goods::updateAllCounters(['price'=>'-123'],['id'=> 36]));

DELETE FROM `goods` WHERE price > :price
---
        /*$goods = Goods::findOne(36);
        dd($goods -> delete());*/

        dd(Goods::deleteAll('price > :price', ['price'=>5] ));